0/Cmu
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cmu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{

    inlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    ground
    {
        type            zeroGradient;
        value           uniform 0;
    }

    #include "include/sideAndTopPatches"

    top
    {
        type            zeroGradient;
        value           uniform 0;
    }

}


// ************************************************************************* //
