0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

kappa                0.4;   // (kappa = 0.4 for equilibrium ; HW2007)
Cmu                  0.09;
Uref                 10.0;
Zref                 20.0;
zDir                 (0 0 1);
flowDir              (1 0 0);
z0                   0.02;
zGround              uniform 0.0;


// When using atmBoundaryLayerParante

// C1                  0;   //  Curve-fitting coefficient (RH when C1=0)
// C2                  1;   //  Curve-fitting coefficient (RH when C2=1)

C1                    -0.5;   //  Curve-fitting coefficient (RH when C1=0)
C2                    4;   //  Curve-fitting coefficient (RH when C2=1)

// Note: If C1 < 0, Z0 is small, and Zmax is large, code may fail due to negative value under sqrt (to fix)


// ************************************************************************* //

// Calculate ABL friction velocity U*
ustar #calc     "$Uref*$kappa / log(($Zref+$z0) / $z0)";

// ************************************************************************* //
